# M4cBook Homebrew Bundle File
# This file contains all the packages and applications needed for AI research and SaaS development

# Homebrew Taps
tap "homebrew/bundle"
tap "homebrew/cask"

# Development Tools
brew "git"
brew "node"
brew "python"
brew "docker"
brew "gh"
brew "wget"

# Applications via Homebrew Cask
cask "postman"
cask "replit"
cask "warp"
cask "visual-studio-code"

# AI Applications
cask "chatgpt"
cask "claude"
cask "perplexity-ask"
cask "macai"

# Optional Tools
brew "render"